app/Models/LeadsModel.php

DELETE FROM `lead_assign`
WHERE `lead_id` = '109557'
---
    public function unassignLead($leadid)
    {
        $this->db
            ->table('lead_assign')
            ->where('lead_id', $leadid)
            ->delete();