app/Models/OrderModel.php

    public function getTotalOrdersByOrderStatusId($order_status_id)
    {
        return $this->db
            ->table('oc_order')
            ->where(
                'order_status_id',
                (int) $order_status_id
            )
            ->where('order_status_id >', 0)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `oc_order`
WHERE `order_status_id` > 0
AND DATE(date_added) = 2026-09-13