app/Models/UserModel.php

SELECT `user_id`, `username`, `password`, `salt`, `status`, `user_group_id`, `firstname`, `lastname`, `email`, `mobile`
FROM `oc_user`
WHERE `username` = 'deepesh'
AND `status` = 1
AND `crm_access` = 1
 LIMIT 1
---
    public function verify_opencart_admin_user(string $username, string $password) {
        $user = $this->select([
            'user_id',
            'username',
            'password',
            'salt',
            'status',
            'user_group_id',
            'firstname',
            'lastname',
            'email',
            'mobile'
        ])
        ->where('username', $username)
        ->where('status', 1)
        ->where('crm_access', 1)
        ->first();